

class Presenter:

    def __init__(self, view):
        self.view = view


    def hide_table(self):
        self.view.window.table.frame.pack_forget()

    def show_table(self):
        subscriptions = [
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (1,"Обычный", 100, 10, "Gym1"),
            (2,"Обычный", 100, 10, "Gym1"),
            ]
        self.view.window.table.insert(subscriptions)






