pub const TASK1_TEXT: &'static str = "
Задание:
Напишите дешифратор для <<ШИФРА КВАДРАТ ПОЛИБИЯ>> и расшифруйте
предоставленную строку:

3 25 56 51 36 53 44 21 31 64 21 66 52 31 16 54 21 64 56
66 52 63 41 43 46 53 53 62 43 64 35 12 43 12 46 4

Квадрат для расшифровки (размерность 6х6, строки разделены запятой):
АБВГДЕ, ЁЖЗИЙК, ЛМНОПР, СТУФХЦ, ЧШЩЪЫЬ, ЭЮЯ. ,
";

pub const TASK1_STR: &'static str = "3 25 56 51 36 53 44 21 31 64 21 66 52 31 16 54 21 64 56 66 52 63 41 43 46 53 53 62 43 64 35 12 43 12 46 4";
